module.exports = {
    base: '/ds/',
    dest: './dist/ds',
    title: '数据结构与算法之美',
    description: "Beauty of Data Structure and Algorithms",
    head: [
        ['link', {
            rel: 'icon',
            href: '/logo.png'
        }]
    ],
    themeConfig: {
        nav: [{
            text: 'Home',
            link: '/'
        }, {
            text: '其他专栏',
            items: [{
                text: '重学前端',
                link: 'https://doc.now.sh/frontend/'
            },{
                text: '深入拆解 Java 虚拟机',
                link: 'https://doc.now.sh/jvm/'
            },{
                text: '趣谈网络协议',
                link: 'https://doc.now.sh/netprotocol/'
            },{
                text: '左耳听风',
                link: 'https://doc.now.sh/air/'
            },{
                text: '深入浅出区块链',
                link: 'https://doc.now.sh/blockchain/'
            }, {
                text: '前端面试之道',
                link: 'https://doc.now.sh/webyck/'
            }, {
                text: 'Web 前端面试指南与高频考题解析',
                link: 'https://doc.now.sh/webinter/'
            }, {
                text: '你不知道的 Chrome 调试技巧',
                link: 'https://doc.now.sh/chrome/'
            }, {
                text: '如何使用 Canvas 制作出炫酷的网页背景特效',
                link: 'https://doc.now.sh/canvas/'
            }, {
                text: 'MySQL实战45讲',
                link: 'https://doc.now.sh/mysql/'
            }]
        }],
        sidebar: [
            ['./article/39922', '开篇词 | 从今天起，跨过“数据结构与算法”这道坎'],
            ['./article/39972', '01 | 为什么要学习数据结构和算法？'],
            ['./article/40011', '02 | 如何抓住重点，系统高效地学习数据结构与算法？'],
            ['./article/40036', '03 | 复杂度分析（上）：如何分析、统计算法的执行效率和资源消耗？'],
            ['./article/40447', '04 | 复杂度分析（下）：浅析最好、最坏、平均、均摊时间复杂度'],
            ['./article/40681', '不定期福利第一期 | 数据结构与算法学习书单'],
            ['./article/40961', '05 | 数组：为什么很多编程语言中数组都从0开始编号？'],
            ['./article/41013', '06 | 链表（上）：如何实现LRU缓存淘汰算法?'],
            ['./article/41149', '07 | 链表（下）：如何轻松写出正确的链表代码？'],
            ['./article/41222', '08 | 栈：如何实现浏览器的前进和后退功能？'],
            ['./article/41330', '09 | 队列：队列在线程池等有限资源池中的应用'],
            ['./article/41440', '10 |  递归：如何用三行代码找到“最终推荐人”？'],
            ['./article/41802', '11 | 排序（上）：为什么插入排序比冒泡排序更受欢迎？'],
            ['./article/41913', '12 | 排序（下）：如何用快排思想在O(n)内查找第K大元素？'],
            ['./article/42038', '13 | 线性排序：如何根据年龄给100万用户数据排序？'],
            ['./article/42359', '14 | 排序优化：如何实现一个通用的、高性能的排序函数？'],
            ['./article/42520', '15 | 二分查找（上）：如何用最省内存的方式实现快速查找功能？'],
            ['./article/42733', '16 | 二分查找（下）：如何快速定位IP对应的省份地址？'],
            ['./article/42896', '17 | 跳表：为什么Redis一定要用跳表来实现有序集合？'],
            ['./article/64233', '18 | 散列表（上）：Word文档中的单词拼写检查功能是如何实现的？'],
            ['./article/64586', '19 | 散列表（中）：如何打造一个工业级水平的散列表？'],
            ['./article/64858', '20 | 散列表（下）：为什么散列表和链表经常会一起使用？'],
            ['./article/65312', '21 | 哈希算法（上）：如何防止数据库中的用户信息被脱库？'],
            ['./article/67388', '22 | 哈希算法（下）：哈希算法在分布式系统中有哪些应用？'],
            ['./article/67856', '23 | 二叉树基础（上）：什么样的二叉树适合用数组来存储？'],
            ['./article/68334', '24 | 二叉树基础（下）：有了如此高效的散列表，为什么还需要二叉树？'],
            ['./article/68638', '25 | 红黑树（上）：为什么工程中都用红黑树这种二叉树？'],
            ['./article/68976', '26 | 红黑树（下）：掌握这些技巧，你也可以实现一个红黑树'],
            ['./article/69388', '27 | 递归树：如何借助树来求解递归算法的时间复杂度？'],
            ['./article/69607', '不定期福利第二期 | 王争：羁绊前行的，不是肆虐的狂风，而是内心的迷茫'],
            ['./article/69913', '28 | 堆和堆排序：为什么说堆排序没有快速排序快？'],
            ['./article/70187', '29 | 堆的应用：如何快速获取到Top 10最热门的搜索关键词？'],
            ['./article/70537', '30 | 图的表示：如何存储微博、微信等社交网络中的好友关系？'],
            ['./article/70891', '31 | 深度和广度优先搜索：如何找出社交网络中的三度好友关系？'],
            ['./article/71187', '32 | 字符串匹配基础（上）：如何借助哈希算法实现高效字符串匹配？'],
            ['./article/71525', '33 | 字符串匹配基础（中）：如何实现文本编辑器中的查找功能？'],
            ['./article/71845', '34 | 字符串匹配基础（下）：如何借助BM算法轻松理解KMP算法？'],
            ['./article/72414', '35 | Trie树：如何实现搜索引擎的搜索关键词提示功能？'],
            ['./article/72810', '36 | AC自动机：如何用多模式串匹配实现敏感词过滤功能？'],
            ['./article/73188', '37 | 贪心算法：如何用贪心算法实现Huffman压缩编码？'],
            ['./article/73503', '38 | 分治算法：谈一谈大规模计算框架MapReduce中的分治思想'],
            ['./article/73786', '不定期福利第三期 | 测一测你的算法阶段学习成果'],
            ['./article/74287', '39 | 回溯算法：从电影《蝴蝶效应》中学习回溯算法的核心思想'],
            ['./article/74788', '40 | 初识动态规划：如何巧妙解决“双十一”购物时的凑单问题？'],
            ['./article/75197', '不定期福利第四期 | 刘超：我是怎么学习《数据结构与算法之美》的？'],
            ['./article/75702', '41 | 动态规划理论：一篇文章带你彻底搞懂最优子结构、无后效性和重复子问题'],
            ['./article/75794', '42 | 动态规划实战：如何实现搜索引擎中的拼写纠错功能？'],
            ['./article/76207', '43 | 拓扑排序：如何确定代码源文件的编译依赖关系？'],
            ['./article/76468', '44 | 最短路径：地图软件是如何计算出最优出行路径的？'],
            ['./article/76827', '45 | 位图：如何实现网页爬虫中的URL去重功能？'],
            ['./article/77142', '46 | 概率统计：如何利用朴素贝叶斯算法过滤垃圾短信？'],
            ['./article/77457', '47 | 向量空间：如何实现一个简单的音乐推荐系统？'],
            ['./article/77830', '48 | B+树：MySQL数据库索引是如何实现的？']
        ]
    }
}